<!-- dflook/terraform-github-actions {"workspace":"fix-self-hosted","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"92312d0fe1b20234ab1f453bdafdfbd60e2d17523d32151826aab44dfe69ad0b","plan_job_ref":"Job Test plan target and replace #382 at https://github.com/dflook/terraform-github-actions/actions/runs/7277293788","plan_hash":"12057caead06bd3ad10e25467814a6320505916b334a111779dfdfee7805a337","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-self-hosted__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "vuglHkKCxL" -> (known after apply)
!~  foreach = "0IUqauijM5" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #382](https://github.com/dflook/terraform-github-actions/actions/runs/7277293788)